develop_vo.2/proyecto/uml/museo.mmd
```mermaid
classDiagram
    class Obra {
      -String id
      -String autor
      -String periodo
      -double valor
      -Date fechaCreacion
      -Date fechaEntrada
      -String sala
      -EstadoObra estado
      +getId(): String
    }
    class Cuadro
    class Escultura
    class OtroObjeto
    Obra <|-- Cuadro
    Obra <|-- Escultura
    Obra <|-- OtroObjeto

    class Restauracion {
      -String tipo
      -Date inicio
      -Date fin
    }
    Obra "1" o-- "0..*" Restauracion : tiene

    class Cesion {
      -String museoDestino
      -Date inicio
      -Date fin
      -double importe
    }
    Obra "0..*" o-- "0..*" Cesion : cede

    class CatalogoService
    class RestauracionService
    class CesionService
    class AuthService

    class Usuario
    class EncargadoCatalogo
    class RestauradorJefe
    class Director
    class Visitante
    Usuario <|-- EncargadoCatalogo
    Usuario <|-- RestauradorJefe
    Usuario <|-- Director
    Usuario <|-- Visitante

    Director --> CatalogoService : consulta
    EncargadoCatalogo --> CatalogoService : gestiona
    RestauradorJefe --> RestauracionService : gestiona
    Visitante --> CatalogoService : consulta por sala

```
